/****************************************Copyright (c)****************************************************
**                                蓝精灵6lowpan无线开发平台
**                                  一切为开源应用而作
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           sys_services.h
** Last modified Date:  2012-11-14
** Last Version:        v1.0
** Description:         系统服务函数实现头文件
**
**--------------------------------------------------------------------------------------------------------
** Created By:          任海波
** Created date:        2012-11-14
** Version:             v1.0
** Descriptions:        初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/

#ifndef  __SYS_SERVICES_H__
#define  __SYS_SERVICES_H__

#ifdef __cplusplus
extern "C" {
#endif


#include "infra/rhb_type.h"

/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
extern void sys_services_init(void);
extern uint32 sys_clock_get(void);
extern void sys_beep_up(uint32 u32time);
extern void sys_led_on(uint8 led);
extern void sys_led_off(uint8 led);
extern void sys_led_toggle(uint8 led);


#ifdef __cplusplus
    }
#endif

#endif

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
