/****************************************Copyright (c)****************************************************
**
**                          一切为理想而作，打造嵌入式WEB节省资源的最优化应用
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:               NumChar.c
** Last modified Date:      2008.11.20
** Last Version:            v1.0
** Description:             字符串与数字之间的一些处理函数
** 
**--------------------------------------------------------------------------------------------------------
** Created By:              任海波
** Created date:            2008.11.20
** Version:                 v1.0
** Descriptions:            The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Description:             
**
*********************************************************************************************************/

#include "NumChar.h"

static unsigned long DecPower[]={1,10,100,1000,10000,100000,1000000,10000000,100000000,1000000000};
/*********************************************************************************************************
** Function name:       PowerCall
** Descriptions:        无符号long型数据的幂运算
** input parameters:    ulSrc:底数
**                      ulPower:幂指数
** output parameters:   无
** Returned value:      幂运算的结果，为一个unsigned long型的数据
** Created by:          任海波
** Created Date:        2008.11.20
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
unsigned long PowerCall(unsigned long ulSrc, unsigned long ulPower)
{
    unsigned long i,ulRtnVal = 0;
    
    if(ulPower == 0)
        return 1;
    else
    {
        ulRtnVal = ulSrc;
        for(i=1; i<ulPower; i++)
        {
            ulRtnVal *= ulSrc;
        }
        return ulRtnVal;
    }
}

/*********************************************************************************************************
** Function name:       strToNumArray
** Descriptions:        将一个数字字符串各个地址中的ASCII码转换为具体代表的数据。如“123”在内存为{0x31,
**                      0x32,0x33},转化后内存中为{1，2，3}
** input parameters:    pscSrc:  转换源字符串
**                      ulLen:   转换源字符串的长度
** output parameters:   pucDest: 转换结果存放参数
** Returned value:      无
** Created by:          任海波
** Created Date:        2008.11.20
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
void strToNumArray(unsigned char *pucDest, const unsigned char *pscSrc, unsigned long ulLen)
{
    unsigned long     i;
    
    for(i=0; i<ulLen; i++)
    {
        *(pucDest+i) = *(pscSrc + i) - 0x30;
    }
}

/*********************************************************************************************************
** Function name:       strToLNum
** Descriptions:        将一个数字字符串转换为长整形数，比如"123"转换为十进制的123
** input parameters:    pscSrc: 要转换的字符串
**                      slLen:  要转换字符串的长度
** Returned value:      转换结果，为一个unsigned long型的数据 
** Created by:          任海波
** Created Date:        2008.11.20
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
unsigned long strToLNum(unsigned char *pscSrc, unsigned long ulLen)
{
    unsigned long     i, ulRtnVal = 0,power = ulLen;

    for(i=0; i<ulLen; i++)
        ulRtnVal += ((pscSrc[i] - 0x30) *  DecPower[--power]);

    return ulRtnVal;
}

/*********************************************************************************************************
** Function name:       charToHex   
** Descriptions:        将一个2字节长度的字符串转换为一个十六进制数，比如"1F"转换为十六进制的0x1F
** input parameters:    Buffer: 要转换的字符串
** Returned value:      转换结果，为一个unsigned char型的数据 
** Created by:          任海波
** Created Date:        2010.7.9
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
unsigned char charToHex(unsigned char *Buffer)
{
    unsigned char ucHex = 0;
    unsigned char i;

    for(i=0; i<2; i++)
    {
        if(Buffer[i] >= '0' && Buffer[i]<='9')
            ucHex |= ((Buffer[i] - '0') << (4-4*i));
        else if(Buffer[i] >= 'A' && Buffer[i]<='F')
            ucHex |= ((Buffer[i] - 'A' + 0x0A) << (4-4*i));
        else if(Buffer[i] >= 'a' && Buffer[i]<='f')
            ucHex |= ((Buffer[i] - 'a' + 0x0A) << (4-4*i));
    }
    
    return ucHex;
}
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/


