/****************************************Copyright (c)****************************************************
**                                蓝精灵6lowpan无线开发平台
**                                  一切为开源应用而作
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           globalmacro.h
** Last modified Date:  2018-04-06
** Last Version:        v1.0
** Description:         全局宏定义
**
**--------------------------------------------------------------------------------------------------------
** Created By:          张校源
** Created date:        2018-04-06
** Version:             v1.0
** Descriptions:        The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/

//定义是否启用自己定义的线程接管物理层
#define RECIVE_SELF 1
#define TIME_STAMP  1
#define PRINT_FRAME 0
#define TIME_SYNCH_NODE 15