/****************************************Copyright (c)****************************************************
**                                蓝精灵6lowpan无线开发平台
**                                  一切为开源应用而作                         
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:               radio_para.c
** Last modified Date:      2018-04-07
** Last Version:            v1.0
** Description:             根据节点号初始化物理层参数
** 
**--------------------------------------------------------------------------------------------------------
** Created By:              张校源
** Created date:            2018-04-07
** Version:                 v1.0
** Descriptions:            The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Description:             
**
*********************************************************************************************************/
#include "radio_para.h"
#include "globalmacro.h"
/*********************************************************************************************************
  全局变量定义
*********************************************************************************************************/
radio_para radiopara;

/*********************************************************************************************************
** Function name:       radio_para_init
** Descriptions:        物理层参数初始化
** input parameters:    0
** output parameters:   无
** Returned value:      moteid
** Created by:          张校源
** Created Date:        2018-04-07
*********************************************************************************************************/
//TODO 根据节点号设置不同的功率

    /*
    ** Step 10, 发送功率设置
    **  AT86RF231                      AT86RF233
    **  0x0 --------->3.0db            0x0 --------->4.0db
    **  0x1 --------->2.8db            0x1 --------->3.7db
    **  0x2 --------->2.3db            0x2 --------->3.4db
    **  0x3 --------->1.8db            0x3 --------->3.0db
    **  0x4 --------->1.3db            0x4 --------->2.5db
    **  0x5 --------->0.7db            0x5 --------->2.0db
    **  0x6 --------->0.0db            0x6 --------->1.0db
    **  0x7 --------->-1db             0x7 --------->0.0db
    **  0x8 --------->-2db             0x8 --------->-1db
    **  0x9 --------->-3db             0x9 --------->-2db
    **  0xA --------->-4db             0xA --------->-3db
    **  0xB --------->-5db             0xB --------->-4db
    **  0xC --------->-7db             0xC --------->-6db
    **  0xD --------->-9db             0xD --------->-8db
    **  0xE --------->-12db            0xE --------->-12db
    **  0xF --------->-17db            0xF --------->-17db
    */


void radio_para_init(){
    radiopara.shortaddr = get_moteid();
    radiopara.pan_id = get_cluster_name(radiopara.shortaddr);
    radiopara.max_frame_retrise = DEFAULT_MAX_FRAME_RETRIES;
    radiopara.max_csma_retries = 0x03;
    radiopara.tx_power = 0x0E;
    radiopara.channel = DEFAULT_CHANNEL;
#if ENABLE_PANID_FILTER
    radiopara.panid_filter = 0;
#else
    radiopara.panid_filter = 1;
#endif
    if(get_moteid() == TIME_SYNCH_NODE )
      radiopara.tx_power = 0x02;
}

/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/
