/****************************************Copyright (c)****************************************************
**                                蓝精灵6lowpan无线开发平台
**                                  一切为开源应用而作
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           test_shell.c
** Last modified Date:  2012-08-03
** Last Version:        v1.0
** Description:         contiki下shell测试
** 
**--------------------------------------------------------------------------------------------------------
** Created By:          任海波
** Created date:        2012-08-03
** Version:             v1.0
** Descriptions:        The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Description:         
**
*********************************************************************************************************/

#include "contiki.h"
#include "dev/serial-line.h"
#include "serial-shell.h"
#include "shell.h"

/*---------------------------------------------------------------------------*/
PROCESS(stm32f10xx_shell_process, "stm32f10xx_shell_process Contiki shell");
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(stm32f10xx_shell_process, ev, data)
{
  PROCESS_BEGIN();

  serial_line_init();
  serial_shell_init();
  shell_ps_init();
  shell_text_init();
  
  // 文件系统命令初始化
  shell_coffee_init();
  shell_file_init();
  
  PROCESS_END();
}
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
